---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarHandleNameData
source: html/8a377169-4ae7-0870-91d7-03bd5dd88ba2.htm
---
# RebarHandleNameData Properties

Specifies whether the .NET object represents a valid Revit entity.